Tekla Open API Reference for Tekla Structures 2025
PropertyElement.PropertyElementType.DetailViewLabelMarkPropertyElementTypes.DrawingName Method
Returns the drawing name property element type.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static PropertyElement.PropertyElementType DrawingName()
Public Shared Function DrawingName As PropertyElement.PropertyElementType
Return Value
Type: PropertyElement.PropertyElementType
The requested property element type.
See Also
Reference
PropertyElement.PropertyElementType.DetailViewLabelMarkPropertyElementTypes Class
Tekla.Structures.Drawing Namespace